print('Задача 5. Вход в систему')

# Что нужно сделать
# Исправьте программу и допишите необходимые команды для получения нужного результата.
# Будьте внимательны при исправлении и помните о правилах названия переменных.

# Программа:

first_name = input('Введите имя пользователя: ')
greeting = 'Привет'
print(greeting, first_name)
invalid = "К сожалению, у Вас нет доступа к системе."
info_invalid = "Пожалуйста, обратитесь к системному администратору."
print(invalid)
print(info_invalid)
# Ожидаемый результат: 

# Введите имя пользователя: Роман
# Привет, Роман
# К сожалению, у Вас нет доступа к системе.
# Пожалуйста, обратитесь к системному администратору.
