print('Задача 2. Финансовый отчёт')

# Наде дали задание сформировать финансовый отчёт за последние 20 лет по полугодиям. 
# Нужно сумму дохода первых двух кварталов поделить на сумму последних двух кварталов, 
# чтобы понять динамику роста или падения дохода. И так за каждый год. 
# 
# Надя решила, 
# что быстрее будет написать простую программу, которая сделает всё за неё.
# 
# 
# Запросите у пользователя четыре числа.
# Отдельно сложите первые два и отдельно вторые два.
# Разделите первую сумму на вторую.
# Выведите результат на экран.
FirstNumber = int(input("Введите сумму дохода первого квартала: "))
SecondNumber = int(input("Введите сумму дохода второго квартала: "))
ThirdNumber = int(input("Введите сумму дохода третьего квартала: "))
FourthNumber = int(input("Введите сумму дохода четвертого квартала: "))
SummFirstAndSecond = FirstNumber + SecondNumber
SummThirdAndFourth = ThirdNumber + FourthNumber
result = SummFirstAndSecond / SummThirdAndFourth
print(result)