data = {
(5000, 123456): ('Иванов', 'Василий'),

(6000, 111111): ('Иванов', 'Петр'),

(7000, 222222): ('Медведев', 'Алексей'),

(8000, 333333): ('Алексеев', 'Георгий'),

(9000, 444444): ('Георгиева', 'Мария')
}

while True:
    input_value = input("Введите номер и серию паспорта через пробел или команду завершить ").split()
    if input_value == ['завершить']:
        break
    input_tuple = (int(input_value[0]), int(input_value[1]))

    for key, value in data.items():
        if key == input_tuple:
            print("Фамилия - {0} "
                  "\nИмя - {1}".format(value[0], value[1]))
            break
    else:
        print("Человека с такими данными паспорта не существует")
